<!-- dflook/terraform-github-actions {"workspace":"pull-request-target-harden-2","backend_type":"remote","backend":"a90fdbc52831fe484c9e2680591bc798b46e8a9b044d49494375ffc2cd6ec69a","plan_job_ref":"Job Test Terraform cloud #368 at https://github.com/dflook/terraform-github-actions/actions/runs/21525285355","plan_hash":"83656770ceb3b31818482eceb7fe059282494f2bbb50e9f6c866f7f73f538487","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __pull-request-target-harden-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #368](https://github.com/dflook/terraform-github-actions/actions/runs/21525285355)
<details open><summary>Outputs</summary>

```hcl
default        = "default"
from_tfvars    = "from_tfvars"
from_variables = "from_variables"
```
</details>